### 📋 Customer Terraform Plan: `failure`

<details><summary>Ver Plan Completo</summary>

```terraform
data.terraform_remote_state.infra: Reading...
data.terraform_remote_state.rds: Reading...
data.terraform_remote_state.infra: Read complete after 0s
data.aws_eks_cluster_auth.cluster: Reading...
data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=tech-challenge-cluster]
data.terraform_remote_state.rds: Read complete after 0s
kubernetes_service.app: Refreshing state... [id=tech-challenge/customer]
kubernetes_deployment.app: Refreshing state... [id=tech-challenge/customer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # kubernetes_secret.db_credentials will be created
  + resource "kubernetes_secret" "db_credentials" {
      + binary_data_wo                 = (write-only attribute)
      + data                           = (sensitive value)
      + data_wo                        = (write-only attribute)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "customer-db-secret"
          + namespace        = "tech-challenge"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Error: Unexpected Identity Change: During the read operation, the Terraform Provider unexpectedly returned a different identity then the previously stored one.

This is always a problem with the provider and should be reported to the provider developer.

Current Identity: cty.ObjectVal(map[string]cty.Value{"api_version":cty.NullVal(cty.String), "kind":cty.NullVal(cty.String), "name":cty.NullVal(cty.String), "namespace":cty.NullVal(cty.String)})

New Identity: cty.ObjectVal(map[string]cty.Value{"api_version":cty.StringVal("apps/v1"), "kind":cty.StringVal("Deployment"), "name":cty.StringVal("customer"), "namespace":cty.StringVal("tech-challenge")})

  with kubernetes_deployment.app,
  on kubernetes.tf line 25, in resource "kubernetes_deployment" "app":
  25: resource "kubernetes_deployment" "app" {

::error::Terraform exited with code 1.

```

</details>

*Pusher: @TheMyFish, Action: `pull_request`*